In [4]:
from sqlalchemy import create_engine
from config import password
import pandas as pd

In [6]:
# Query constants
EMPLOYEES_QUERY = "SELECT * FROM employees"
DEPARTMENTS_QUERY = "SELECT * FROM departments"
SALARIES_QUERY = "SELECT * FROM salaries"
TITLES_QUERY = "SELECT * FROM titles"
DEPT_EMP_QUERY = "SELECT * FROM dept_emp"
DEPT_MANAGER_QUERY = "SELECT * FROM dept_manager"

In [3]:
# Connect to the database with sqlalchemy
### postgresql://postgres:{password}@localhost:5432/database_name
engine = create_engine(f'postgresql://postgres:{password}@localhost:5432/department_store')
connection = engine.connect()

In [7]:
# Import the SQL database into Pandas.

def create_pandas_table(sql_query, database = connection):
    table = pd.read_sql_query(sql_query, database)
    return table

departments_pd = create_pandas_table(DEPARTMENTS_QUERY)
employees_pd = create_pandas_table(EMPLOYEES_QUERY)
salaries_pd = create_pandas_table(SALARIES_QUERY)
titles_pd = create_pandas_table(TITLES_QUERY)
dept_emp_pd = create_pandas_table(DEPT_EMP_QUERY)
dept_manager_pd = create_pandas_table(DEPT_MANAGER_QUERY)

In [8]:
# Preview table
employees_pd.head()

   emp_no emp_title_id  birth_date  first_name  last_name sex   hire_date
0  473302        s0001  1953-07-25    Hideyuki   Zallocco   M  1990-04-28
1  475053        e0002  1954-11-18       Byong  Delgrande   F  1991-09-07
2   57444        e0002  1958-01-30       Berry       Babb   F  1992-03-21
3  421786        s0001  1957-09-28       Xiong   Verhoeff   M  1987-11-26
4  282238        e0003  1952-10-28  Abdelkader    Baumann   F  1991-01-18

In [ ]:
# Create a histogram to visualize the most common salary ranges for employees.

In [ ]:
# Create a bar chart of average salary by title.